#研发者：时间遗忘
#开发时间：2023/8/19 21:11
import numpy as np

#不同方式创建数组
#创建指定维度和数据类型未初始化的数组
#n1=np.empty([4,3])#4行3列随机数
n1=np.empty([4,3],dtype=int)
print(n1)


#创建指定维度以0填充的数组
n2=np.zeros(4)          #默认是浮点类型，如果不是整数类型就不会出现那个点
print(n2)

n21=np.zeros([4,3])
print(n21)


#创建指定维度以1填充的数组
n3=np.ones(4)           #生成的数据类型是浮点数
print(n3,n3.dtype)


#创建指定维度和类型的数组，并以指定值填充
n4=np.full([4,3,5],666)             #4行3行3列的数组
print(n4,type(n4))

n5=np.full((4,3,5),66)              #中括号和小括号生成结果相同，但这里要求是小括号
print(n5,type(n5))

'''
[4,3,5]         #4行3列中间一个单元格有5个数
[[[666 666 666 666 666] [666 666 666 666 666] [666 666 666 666 666]]

 [[666 666 666 666 666] [666 666 666 666 666] [666 666 666 666 666]]

 [[666 666 666 666 666] [666 666 666 666 666] [666 666 666 666 666]]

 [[666 666 666 666 666] [666 666 666 666 666] [666 666 666 666 666]]]
  '''

'''
(4,3,5)         #中括号和小括号生成结果相同
[[[66 66 66 66 66] [66 66 66 66 66] [66 66 66 66 66]]

 [[66 66 66 66 66] [66 66 66 66 66] [66 66 66 66 66]]

 [[66 66 66 66 66] [66 66 66 66 66] [66 66 66 66 66]]

 [[66 66 66 66 66] [66 66 66 66 66] [66 66 66 66 66]]]
 '''
