#研发者：时间遗忘
#开发时间：2022/10/2 18:05

#流程控制语句break和conotinue在二重循环中用于控制本层循环
#具体那层看range（）所处的位置
#break跳入外循环，重新开始内循环/退出内循环，进入外循环
'''
while...:                           while...:
     ...                                 ...  ____________________
      ______________                     _____|________________  |
     |             |                    |     |               |  |
     |for...:      |                    |for...:              |  |
     |   ...       |                    |   ...               |  |
     |   if...:    |                    |   if...:            |  |
     |     break---|---                 |     continue--------|---
     |   ...       |  |                 |   ...               |
     |else:        |  |                 |else:                |
     |   ...       |  |                 |   ...               |
     |_____________|  |                 |_____________________|
                      |             ...
 _____________________|
 |
...
'''
for i in range(5):#代表外层循环要执行5次
    for j in range(1,11):
        if j%2==0:
            break
        print(j)

for i in range(5):#代表外层循环要执行5次
    for j in range(1,11):
        if j%2==0:
            #break
            continue
        print(j,end='\t')
    print()